app/Controllers/productos.php

    public function index() //: string
    {

        // instanciar modelo productosModel

        $productosModel = new ProductosModel();

       // obtener datos de la bd
        $productos=$productosModel->findAll();
---
SELECT *
FROM `productos`

    public function ver($id) //: string
    {

        // instanciar modelo productosModel

        $productosModel = new ProductosModel();

       // obtener datos de la bd del prod selecc
        $producto=$productosModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '9'

    public function guardar()
    {
        // Obtener datos del formulario
        $nombre = $this->request->getPost('nombre');
        $descripcion = $this->request->getPost('descripcion');
        $precio = $this->request->getPost('precio');

        // Definir reglas de validación
        $rules = [
            'nombre' => 'required',
            'precio' => 'required|numeric',
        ];

        // Validar los datos del formulario
        if (!$this->validate($rules)) {  // Si la validación falla
            return redirect()->back()->withInput()->with('validation', $this->validator);
        }

        // Instanciar el modelo y preparar los datos
        $productosModel = new ProductosModel();
        $productoData = [
            'producto' => $nombre,
            'descripcion' => $descripcion,
            'precio' => $precio,
        ];

        // Insertar los datos en la base de datos
        $productosModel->insert($productoData);
---
INSERT INTO `productos` (`producto`, `descripcion`, `precio`) VALUES ('Bananas', 'Bananas de ecuador', '3335')